. tempfile file_q25 file_q75 file_reg

. preserve

. binsqreg y x, quantile(0.25) line(3 3) savedata(`file_q25')
Sorting dataset on x...
Note: This step is omitted if dataset already sorted by x.

Binscatter plot, quantile
Bin selection method: IMSE-optimal plug-in choice
Placement: Quantile-spaced
Derivative: 0
Output file: /var/folders/85/ghqhbjfx4ysg9_s5gs0byqlw0000gn/T//S_02658.000003.dta

----------------------------------------------
# of observations             |    1000
# of distinct values          |    1000
# of clusters                 |       .
------------------------------+---------------
Bin selection:                | 
         Degree of polynomial |       0
  # of smoothness constraints |       0
                    # of bins |      20
----------------------------------------------

----------------------------------------
         |      p       s       df
---------+------------------------------
 dots    |      0       0       20
 line    |      3       3       23
----------------------------------------

. binsqreg y x, quantile(0.75) line(3 3) savedata(`file_q75')
Sorting dataset on x...
Note: This step is omitted if dataset already sorted by x.

Binscatter plot, quantile
Bin selection method: IMSE-optimal plug-in choice
Placement: Quantile-spaced
Derivative: 0
Output file: /var/folders/85/ghqhbjfx4ysg9_s5gs0byqlw0000gn/T//S_02658.000004.dta

----------------------------------------------
# of observations             |    1000
# of distinct values          |    1000
# of clusters                 |       .
------------------------------+---------------
Bin selection:                | 
         Degree of polynomial |       0
  # of smoothness constraints |       0
                    # of bins |      20
----------------------------------------------

----------------------------------------
         |      p       s       df
---------+------------------------------
 dots    |      0       0       20
 line    |      3       3       23
----------------------------------------

. binsreg y x, line(3 3) cb(3 3) savedata(`file_reg')
Sorting dataset on x...
Note: This step is omitted if dataset already sorted by x.

Binscatter plot
Bin selection method: IMSE-optimal plug-in choice
Placement: Quantile-spaced
Derivative: 0
Output file: /var/folders/85/ghqhbjfx4ysg9_s5gs0byqlw0000gn/T//S_02658.000005.dta

----------------------------------------------
# of observations             |    1000
# of distinct values          |    1000
# of clusters                 |       .
------------------------------+---------------
Bin selection:                | 
         Degree of polynomial |       0
  # of smoothness constraints |       0
                    # of bins |      20
----------------------------------------------

----------------------------------------
         |      p       s       df
---------+------------------------------
 dots    |      0       0       20
 line    |      3       3       23
 CB      |      3       3       23
----------------------------------------

. use `file_reg', clear

. append using `file_q25' `file_q75', generate(source)

. twoway (scatter dots_fit dots_x if source==0, mcolor(navy)) ///
>        (line line_fit line_x if source==0, sort lcolor(navy)) ///
>            (rarea CB_l CB_r CB_x if source==0, sort fcolor(navy%50) lcolor(none%0) finte
> nsity(50)) ///
>            (line line_fit line_x if source==1, sort) ///
>            (line line_fit line_x if source==2, sort), ///
>            ytitle(Y) xtitle(X) title(Binscatter Plot) ///
>            legend(order(1 "E[Y|X]" 2 "E[Y|X]" 3 "Conf. Band for E[Y|X]" 4 "0.25 quantile
> " 5 "0.75 quantile"))

. restore

